<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>MD. R-Moreno's PhD Thesis</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link href="estilos/estilocss.css" rel="stylesheet" type="text/css">
</head>
<body bgcolor="#fdfeff" background="iconos/fondo_libros.jpg" lang=ES
link=blue vlink=purple style='tab-interval:35.45pt' bgproperties=fixed>

<body>
<p class="texto">PhD Thesis</p>
<p class="texto">&nbsp;</p>
<p class="fecha">&nbsp;</p>
<p class="alineada"> <strong>T&iacute;tulo</strong> (Tittle): <a href="http://atc1.aut.uah.es/~mdolores/Docs/2003/MDR-Moreno-thesis.pdf">Representing and 
  Planning tasks with time and resources</a> </p>
<p class="alineada"> <strong>Directores</strong> (Supervisors): <a href= "http://scalab.uc3m.es/~dborrajo/">Dr. 
  Daniel Borrajo Millán </a> and <a href= "http://atc2.aut.uah.es/~dmeziat/"> 
  Dr. Daniel Meziat Luna</a> 
<p class="alineada"><a href = "#abstract">Abstract</a> (<a href = "#resumen">Resumen</a>) 
<p class="alineada">
<p align="center" class="normal"><a href = "index.html"> <img src="iconos/home.jpg" width="38" height="38"></a></p>
<hr>
<p class="alineada">
<p class="alineada"><strong><a name="abstract">Abstract</a></strong> 
<p class="alineada">Any problem solving technique in Artificial Intelligence (AI), 
  as an area in Computer Science, must face two aspects when providing computational 
  solutions to problems: knowledge representation and the methods used to reason. 
  One of the solving techniques that has gained recent importance inside AI is 
  planning and scheduling. </p>
<p class="alineada">In this Ph.D. thesis we study these two aspects for AI planning 
  and scheduling. The first goal will be to face the problem of knowledge representation 
  in two real domains. First we have dealt with workflow domains by means of the 
  SHAMASH workflow modeling tool and the COSMOSS workflow system at British Telecom. 
  Second, we have used the satellites domain for HISPASAT, a Spanish multi-mission 
  system in charge of satisfying national communication needs. For this domain, 
  we will be in charge of providing a solution to the ground nominal operations 
  for its satellites. </p>
<p class="alineada">But these domains need the integration of techniques from 
  planning and scheduling. Traditionally, there is a clear subdivision of techniques 
  and roles that belong to planning and scheduling. Planning systems select and 
  order sets of activities such that they achieve one or more goals and satisfy 
  a set of domain constraints. For most part, planning research has focused on 
  finding a feasible chain of actions that accomplish one or more goals.<br>
  Scheduling systems are in charge of assigning resources and time for activities, 
  obeying their temporal restrictions and the capacity limitations of shared resources. 
  Scheduling is an optimisation task where limited resources are allocated over 
  time among both parallel and sequential activities, such that deadlines and 
  makespan are minimised. </p>
<p class="alineada">The second goal will be to study the weak and strong points 
  of both fields. Planning systems have a rich representation of the problem descriptions 
  but they have limitations to reason about time and handle cumulative resources. 
  Scheduling systems can perfectly handle temporal and resources reasoning, but 
  there is a lack of expressive language to represent the problem. </p>
<p class="alineada">From this perspective, by combining scheduling and planning 
  systems synergistically these weaknesses can be solved. We present here different 
  models to integrate planning and scheduling: from the stand alone approach of 
  using a planner, to the pipeline integration of using a planner and a scheduler, 
  towards the more integrated approach of interleaving planning and scheduling. 
  This last approach will be compared against the other two models and some state 
  of the art planners, showing its effectiveness.</p>
<p class="alineada">&nbsp;</p>
<p class="alineada">&nbsp;</p>
<p align="center" class="normal"><a href = "index.html"> <img src="iconos/home.jpg" width="38" height="38"></a></p>

<hr>
<p class="alineada"><strong><a name="resumen">Resumen Ampliado</a> </strong></p>
<p class="alineada">En esta tesis hemos abordado como <em><strong>primer objetivo</strong></em>, 
  el problema de la representaci&oacute;n del conocimiento para planificaci&oacute;n 
  en dos dominios reales. <br>
  Uno de los obst&aacute;culos en aplicar t&eacute;cnicas de planificaci&oacute;n 
  a dominios reales es la dificultad en modelar dominios. Generalmente se necesita 
  que las personas que han participado en su desarrollo deban llevar a cabo la 
  fase de modelado ya que en muchos casos la representaci&oacute;n depende bastante 
  del conocimiento del funcionamiento interno de la herramienta. </p>
<p class="alineada">Uno de los dominios pertenece a los sistemas de planificaci&oacute;n 
  de actividades de negocio, como son los sistemas de gesti&oacute;n de procesos 
  conocidos como sistemas de <em>Workflow</em>. El otro pertenece al dominio de 
  los sat&eacute;lites, en concreto se ha realizado la modelizaci&oacute;n de 
  las operaciones nominales que desde tierra se deben llevar a cabo en el operador 
  espa&ntilde;ol de telecomunicaciones por sat&eacute;lite Hispasat.</p>
<p class="alineada">En los sistemas de gesti&oacute;n de procesos se han dedicado 
  esfuerzos para la defini- ci&oacute;n de lenguajes que permitan a usuarios no 
  expertos, introducir facilmente el conocimiento de los procesos en las herramientas 
  con las que trabajan. Se ha utilizado la herramienta de modelado de procesos 
  Shamash y el sistema de workflow en British Telecom llamado COSMOSS para introducir 
  el conocimiento. Dicho conocimiento ser&aacute; traducido en t&eacute;rminos 
  de l&oacute;gica de predicados (por ejemplo al lenguaje est&aacute;ndar de representaci&oacute;n 
  de dominios de planificaci&oacute;n PDDL2.1). Despu&eacute;s de esta conversi&oacute;n, 
  se podr&aacute;n validar y generar automaticamente modelos reales utilizando 
  cualquier planificador que soporte PDDL2.1. <br>
  Con la uni&oacute;n, los planificadores ganan un lenguaje f&aacute;cil de utilizar 
  por cualquier usuario y a los sistemas de <em>Workflow</em> les permiten generar 
  y validar los modelos de los procesos que se deben realizar a diario en sus 
  empresas. </p>
<p class="alineada">Para la empresa de telecomunicaciones por sat&eacute;lite 
  Hispasat hemos desarrollado la herramienta CONSAT (CONtrol de SAT&eacute;lites) 
  para ayudar a dar soluci&oacute;n al problema de planificar las operaciones 
  que desde tierra deben llevar a cabo el grupo de ingenieros. Cada a&ntilde;o 
  este grupo genera toda la documentaci&oacute;n necesaria a mano y en papel. 
  Existen dos tipos de documentos, uno que proporciona una visi&oacute;n de las 
  operaciones que se deben realizar cada d&iacute;a del a&ntilde;o, y otro que 
  representa con m&aacute;s detalle las operaciones que se deben realizar cada 
  semana. Una vez generados los documentos, se revisan y se verifican. Debido 
  al incremento del n&uacute;mero de sat&eacute;lites (actualmente cuatro y en 
  el futuro dos m&aacute;s), esta tarea necesita ser automatizada.</p>
<p class="alineada"> CONSAT da soluci&oacute;n a estos problemas gracias a los 
  tres subsistemas de los que consta:</p>
<p class="alineada"><em>- El subsistema de usuario</em> se encarga de controlar 
  el acceso de los usuarios as&iacute; como la manipulaci&oacute;n de todos los 
  ficheros y datos de entrada necesarios para la planificaci&oacute;n de todas 
  las operaciones.<br>
  <br>
  <em>- El subsistema razonador</em> una vez que los datos han sido introducidos 
  correctamente, un planificador se encargar&aacute; de dar soluci&oacute;n al 
  problema.<br>
  <br>
  <em>- El subsistema generador</em>: es responsable de mantener la coherencia 
  entre las dos posibles representaciones que los ingenieros necesitan: la &quot;anual&quot; 
  y la &quot;semanal&quot;. Cualquier modificaci&oacute;n que se realice en una 
  representaci&oacute;n ser&aacute; actualizada automaticamente en la otra, evitando 
  los fallos de incongruencias muy habituales al generarse a mano. Adem&aacute;s, 
  este subsistema genera la soluci&oacute;n en el tipo de formato que utilizan 
  en Hispasat, permite comparar dos soluciones diferentes o generarlas en HTML. 
</p>
<p class="alineada">Pero en la planificaci&oacute;n de estos dominios se necesita 
  trabajar con tiempo y recursos. Dentro del &aacute;rea de planificaci&oacute;n 
  se distinguen b&aacute;sicamente dos grandes campos: la planificaci&oacute;n 
  y el <em>scheduling</em>. </p>
<p class="alineada"> Por planificaci&oacute;n se entiende la selecci&oacute;n 
  de una secuencia de actividades de tal forma que satisfagan una o varias metas 
  y un conjunto de restricciones impuestas por el dominio. La mayor&iacute;a de 
  las investigaciones realizadas en planificaci&oacute;n se han centrado en encontrar 
  un conjunto ordenado de acciones que satisfagan una o m&aacute;s metas. </p>
<p class="alineada">Por <em>scheduling</em> se entiende la asignaci&oacute;n de 
  recursos y tiempos de inicio de las actividades, obedeciendo a las restricciones 
  temporales de las actividades y las limitaciones de capacidad de los recursos 
  compartidos. Scheduling es tambi&eacute;n una tarea de optimizaci&oacute;n donde 
  recursos limitados se disponen a lo largo del tiempo entre actividades que se 
  pueden ejecutar en serie o en paralelo de acuerdo con el objetivo de, por ejemplo, 
  minimizar el tiempo de ejecuci&oacute;n de todas las actividades. </p>
<p class="alineada">Como <strong><em>segundo objetivo</em></strong>, en este trabajo, 
  se han identificado los puntos d&eacute;biles y fuertes de la planificaci&oacute;n 
  y scheduling y se ha propuesto una soluci&oacute;n que integra ambos campos. 
  Se han presentado distintos modelos de integraci&oacute;n: desde la utilizaci&oacute;n 
  de un planificador para resolver los problemas de los dominios expuestos anteriormente, 
  pasando por la integraci&oacute;n en l&iacute;nea de un planificador y un <em>scheduler</em>, 
  hasta el enfoque m&aacute;s integrado que entremezcla planificaci&oacute;n y 
  <em>scheduling</em>: IPSS (Integrated Planning and Scheduling System). </p>
<p class="alineada">En IPSS el razonamiento se divide en dos niveles. El planificador 
  se encarga de la selecci&oacute;n de acciones (puede optimizar seg&uacute;n 
  una m&eacute;trica de calidad diferente al tiempo o recurso) y el <em>scheduler</em> 
  de la asignaci&oacute;n del tiempo y los recursos. Durante el proceso de b&uacute;squeda, 
  cada vez que el planificador decide aplicar un operador, consulta al <em>scheduler</em> 
  para comprobar su consistencia temporal y de recursos. Si es inconsistente el 
  planificador vuelve hacia atr&aacute;s y genera otra secuencia de acciones. 
</p>
<p class="alineada">IPSS consta de tres capas: </p>
<p class="alineada">- La capa <em>Deordering</em>: tiene como misi&oacute;n convertir 
  el plan incompleto totalmente ordenado en un plan incompleto parcialmente ordenado.<br>
  <br>
  - La capa <em>Ground-CSP</em>: se encarga de crear una Red Temporal, a&ntilde;adiendo 
  los operadores y las retricciones causales y temporales entre ellos.</p>
<p class="alineada">- La capa <em>Meta-CSP</em>: razona sobre los conflictos de 
  recursos que pueden ocurrir entre pares de actividades que consumen el mismo 
  recurso. <br>
</p>
<p class="alineada">Los resultados demuestran la eficacia de IPSS frente a los 
  enfoques de integrar planificaci&oacute;n y <em>scheduling</em> en l&iacute;nea 
  y respecto a otros sistemas de planificaci&oacute;n actuales cuando se puede 
  realizar una separaci&oacute;n entre los recursos y predicados l&oacute;gicos 
  y se puede imponer una duraci&oacute;n m&aacute;xima al plan soluci&oacute;n. 
</p>
<p align="center" class="normal"><a href = "index.html"> <img src="iconos/home.jpg" width="38" height="38"></a></p>
<p align="center" class="normal">&nbsp;</p>

<p class="pieAzul"> <a target="_blank" href="http://v1.nedstatbasic.net/stats?ABSKtgjUUP8kqXiGL/IttkoDSqAg"> 
  <img src="http://m1.nedstatbasic.net/n?id=ABSKtgjUUP8kqXiGL/IttkoDSqAg"border="0" nosave width="18" height="18"></a> 
  Last update: March 2005 
<p class="pieAzul">© Copyright María Dolores Rodríguez Moreno. </p>

</body>
</html>
